Repository: 84000/translation-memory-resources
Catalog: post_input/toh287-C.bo.en.tmx
Source language: bo
Languages: en

source: དེ་ལྟ ར་ དེ་ འོངས་པ་ མངོན་པར་ མཐོང་ ནས །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ གྱིས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ དེ་དག་ ལ་ སྨྲས་པ །_
en: $318 “When the asura ruler Rāhu sees them coming, he will call to the other asura rulers,

source: འདི་ལྟར་ ཀླུ་ ཕམ་པ་ དེ་དག་ ལ་ ཁྱེད་ ཀྱི་ ཡིད་ དྲང་པོ ར་ ལྟོས་ ཤིག _། དེ་སྐད་ སྨྲས་ ནས །_ བདག་ དང་ བཅས་པ འི་ དཔུང་ དེས་ བརྒྱུགས་ སོ །_།
en: ‘Take a good look at those defeated nāgas!’ They and their armies will then surge ahead.

source: དེ་ འོང་བ་ མཐོང་ ནས་ ལྷ་ ལག་ ན་ཡོལ་ གོ་ ཐོགས་པ་ རྣམས་ ཀྱིས་ ཀྱང་ བརྒྱུགས་ ཏེ །_ དེ་ལྟ ར་ དེ་དག་ ཕན་ཚུན་ འོང་བ་ ན །_ རྒྱ་མཚོ འི་ དབུས་ སུ་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ རི འི་ རྩེ་མོ་ མི་བཟད་པ་ འཕེན་པ །_ ཤིན་ཏུ་ འཇིགས་ སུ་ རུང་བ །_ ཤིན་ཏུ་ བཟོད་པ ར་ དཀའ་བ འི་ གཡུལ་ བཀྱེའོ །_།
en: When the vessel-bearer gods see them coming, they too will surge forward, and, as their armies clash, the gods and asuras will proceed to hurl giant mountaintops at each other and engage in an extremely terrifying and totally excruciating battle in the middle of the ocean.

source: ལྷ་ དང་ ལྷ་མ་ ཡིན་ རྣམ་པར་ འཁྲུགས་པ་ དེས་ ལྷ་མ་ ཡིན་ རྒྱ་མཚོ་ ན་ རྒྱུ་བ་ འབུམ་ཕྲག་ དུ་མ་ དག་ ལས་ ཁ་ཅིག་ ནི་ འོན་པ ར་ གྱུར །_ ཁ་ཅིག་ ནི་ སྲོག་ དང་ བྲལ་ ལོ །_།
en: In the course of their fighting, some among the hundreds of thousands of asuras that thus glide upon the sea will either lose their hearing or lose their lives.

source: ལྷ་ དང་ ལྷ་མ་ ཡིན་ དེ་དག་ རྣམ་པར་ འཁྲུགས་པ ས །_ མཚོན་ཆ་ འབུམ་ཕྲག་ ཉམ་ང་བ་ ཆར་ ལྟར་ བབ་པ འི་ གཡུལ་ བཀྱེའོ །_།
en: The battling gods and asuras will release a rain of hundreds of thousands of dreadful weapons upon each other.

source: དེ་ནས་ ཁྱད་པར་ ནི་ འདི་ ཡོད་ དེ །_ ལྷ་ གང་ གི་ རྐང་པ་ བཅད་ ན་ སླར་ ནད་མེད་ པར་ སྐྱེ་བ ར་ འགྱུར །_ ལག་པ་ བཅད་ ན་ ཡང་ ནད་མེད་ པར་ སྐྱེ་བ ར་ འགྱུར །_
en: $319 “A special feature of the gods is that whenever they lose a leg, it will grow out again, and whenever one of their arms is cut off, a new one will likewise grow out to replace it.

source: དེ་ལྟ ར་ ཡན་ལག་ དང་ ཉིང་ལག་ ཐམས་ཅད་ བཅད་ ཅིང་ གཏུབས་ ཀྱང་ སྐྱེ་བ ར་ འགྱུར་ ཏེ །_
en: Thus, whatever major or minor body part a god may lose, a new one will grow out in its place.

source: ནད་མེད་པ་ དང་ །_ གནོད་པ་ མེད་པ་ དང་ །_ མདོག་ ཉམས་པ ར་ མི་ འགྱུར་ ལ །_ དེ འི་ ཚེ་ སྐྱེ་ ཞིང་ འབྱུང་བ ར་ འགྱུར་ རོ །_།
en: Consequently, they do not become incapacitated, nor is their healthy complexion ruined or lost.

source: མགོ་ བཅད་པ་ ནི་ མ་གཏོགས་ ཏེ །_ ལྷ་ རྣམས་ ཀྱི་ དགྲ་ ཡང་ ཞི་བ ར་ འགྱུར་ རོ །_། ལྷ་མ་ ཡིན་ རྣམས་ ཀྱང་ ཇི་ལྟ ར་ མི་ རྣམས་ ལ་ མཚོན་ཆ ས་ བཏབ་ ན་ གནོད་པ་ དེ་ལྟ ར་ ལྷ་མ་ ཡིན་ རྣམས་ ལ་ ཡང་ དེ་བཞིན་ དུ་ འབྱུང་ སྟེ །_
en: The only exception is when a god is decapitated, in which case even the enemy of the gods will be pacified.#249 The asuras, on the other hand, are hurt by weapons in the same way as humans.

source: ལྷ་ དང་ ལྷ་མ་ ཡིན་ དག་ ནང་ གི་ ཁྱད་པར་ ནི་ དེ་ལྟ་ བུ་ ཡིན་ ཏེ །_ དེ་ལྟ ར་ ལྷ་ ལག་ ན་ཡོལ་ གོ་ ཐོགས་པ་ རྣམས་ དང་ །_ ལྷ་མ་ ཡིན་ སྒྲ་གཅན་ གྱི་ ས ར་ གཏོགས་པ་ རྣམས་ ཀྱི་ ཁྱད་པར་ ནི་ དེ་ལྟ་ བུ་ ཡིན་ ནོ །_།
en: Such are the differences between gods and asuras, or between the vessel-bearer gods and the asuras belonging to Rāhu’s level.

source: དེ་ནས་ ལྷ་ ལག་ ན་ཡོལ་ གོ་ ཐོགས་པ་ རྣམས་ ཀྱིས་ རི་རྩེ་ མོ་ ཅན་ དུ་མ་ བླངས་ ནས་ [44b] ལྷ་མ་ ཡིན་ ག་ལ་བ་ དེར་ བརྒྱུགས་ ཏེ །_ རི་ ཆར་ ལྟར་ འབེབས་པ་ དེས་ ལྷ་མ་ ཡིན་ དེ་དག་ གི་ དཔུང་ བརྒྱ འམ །_ སྟོང་ དུ་ བཅོམ་ མོ །_།
en: $320 “The vessel-bearer gods will lift up numerous mountain peaks [44.b] and then storm the asuras, releasing a rain of falling mountains on them that will smash the asura army in hundreds and thousands of ways.

source: དེ་ བཅོམ་པ་ མངོན་པར་ མཐོང་ ནས །_ སྒྲ་གཅན་ གྱིས་ རི་ དཔག་ཚད་ གསུམ་པ་ བླངས་ ནས་ བརྒྱུགས་ སོ །_།
en: When Rāhu sees that, he will himself lift up a mountain measuring three leagues.

source: ལྷ་ ལག་ ན་ཡོལ་ གོ་ ཐོགས་པ་ རྣམས་ ཀྱིས་ དེ་ལྟ ར་ འོང་བ་ མངོན་པར་ མཐོང་ ནས །_
en: Noticing that he is rushing toward them, the vessel-bearer gods will take up their weapons and arms and race toward him.

source: མཚོན་ཆ་ དང་ ལག་ཆ་ ཐོགས་ ཏེ །_ ལྷ་མ་ ཡིན་ ག་ལ་བ་ དེར་ བརྒྱུགས་ སོ །_། རི་ དེ་ མཚོན་ཆ་ ཆར་ ལྟར་ ཕབ་པ་ དེས་ ཇི་ལྟ ར་ བྱེ་མ་ བཞིན་ དེ་ལྟ ར་ ཞིབ་མོ ར་ བརླགས་ ནས་ རྒྱ་མཚོ འི་ ནང་ དུ་ གཏོར་ ཏོ །_།
en: As they rain down their weapons upon Rāhu’s mountain, it will be reduced to dust and crumble into the sea.

source: དེ་ འོང་བ་ མངོན་པར་ མཐོང་ ནས་ དུད་འགྲོ འི་ ངོ་བོ་ སེམས་ཅན་ གྱི་ ཐ་མ་ སྒྲ་གཅན་ དེ་ ཡོངས་སུ་ ཡི་ ཆད་ དོ །_། མཚོན་ཆ་ ཆར་ ལྟར་ འབབ་པ་ ན་ ལྷ་མ་ ཡིན་ གྱི་ དཔུང་ ག་ལ་བ་ དེར་ བརྒྱུགས་ སོ །_།
en: Seeing this, the animal Rāhu, the most inferior among sentient beings, will completely lose heart and, in a rain of the weapons, run back toward the asura army.

source: ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ ས་ དེ་ འོང་བ་ མངོན་པར་ མཐོང་ ནས །_ རང་ གི་ འཁོར་ རྣམས་ ལ་ སྨྲས་པ །_
en: $321 “When the asura ruler Firm sees this, he will tell his retinue,

source: རི་རབ་ གཉིས་ ཀྱི་ ཚད་ ལྟར་ འདུག་པ་ ཆས་པ་ འདི་ གཅིག་པུ ས་ ལྷ་ འདི་དག་ ཐམས་ཅད་ ཆད་པ ས་ གཅད་པ ར་ ནུས་ སུ་ གཤའ་ གཤའ་ ལྟ་ ཞིག་ ན །_
en: ‘Rāhu is twice as big as Mount Sumeru, so he should be able to punish these gods single-handedly.

source: འདི་ལྟར་ བོང་ ཚོད་ འབའ་ཞིག་ ཆེ ར་ ཟད་ དེ་ མཐུ་ ཆུང་ ནས་ ལྷ་ རྣམས་ ཀྱིས་ བསྔགས་པ་ དང་ །_ མགོན་ འདོད་པ །_ སྐྱབས་ འདོད་པ །_ དཔུང་གཉེན་ འདོད་པ །_
en: Yet, in spite of his size, he shows only meager power, and so the gods are now shaming him as he runs back to the asuras, yearning for safety, refuge, and protection.

source: ལྷ་མ་ ཡིན་ ག་ལ་བ་ དེར་ རྒྱུག་པ ར་ བྱེད་པ །_ ལྷ་མ་ ཡིན་ ཕལ་པ་ དང་ མཚུངས་པ་ འདི་ ནི་ མཐུ་ དམན་པ་ ཡིན་ ལ་ སྨད་པ་ ཉིད་ ཡིན་ ནོ །_།
en: He is no more than an ordinary asura. He is weak and loathsome.

source: འདི འི་ མདུན་ ན་ འཐབ་པ ར་ གནས་པ་ ལྷ་ ལག་ ན་ཡོལ་ གོ་ ཐོགས་པ་ གང་ཡིན་པ་ འདི་དག་ ནི་ སྙིང་སྟོབས་ ཆེ་བ་ ཡིན་ ནོ །_།
en: The vessel-bearer gods who are fighting him have more courage than he does.’

source: དེ་སྐད་ སྨྲས་ ནས །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ རང་ གི་ འཁོར་ དང་ ཡང་ ལྷན་ཅིག་ ལྷ་མ་ ཡིན་ མཆོག་ ཏུ་ རྒྱ་ཆེ་བ་ མགུལ་ ཕྲེང་ དང་ ཡང་ ལྷན་ཅིག་ ཏུ་ གཡུལ་འགྱེད་པ འི་ ཕྱིར་ ལྷ་ ལག་ ན་ཡོལ་ གོ་ ཐོགས་པ་ ག་ལ་བ་ དེར་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: $322 “When he has uttered these words, the asura ruler Firm will then, assisted by his own retinue and the very large necklace asuras, launch an attack on the vessel-bearer gods.

source: ལྷ་ རྣམས་ ཀྱིས་ བརྟན་པ་ དང་ དེ་དག་ ལྷན་ཅིག་ འོང་བ་ མཐོང་ ནས་ ལྷ་ ཕྲེང་ཐོགས་ རྣམས་ ལ་ སྨྲས་ སོ །_།
en: When the vessel-bearer gods see them coming, they will call to the garland-bearer gods,

source: འདི་ལྟར་ བརྟན་པ་ བདག་ཉིད་ ཐམས་ཅད་ ལྷ་ ལག་ ན་ཡོལ་ གོ་ ཐོགས་པ་ རྣམས་ ཀྱི་ དྲུང་ དུ་ རྒྱུག་ གིས་ ལྷ་ རྣམས་ ཀྱང་ རྒྱུགས་ ཤིག་ རྒྱུགས་ ཤིག _།
en: ‘Firm is attacking us, the vessel-bearer gods, so the gods should counterattack now! The gods must go on the offensive!’

source: དེ་སྐད་ སྨྲས་ ནས་ དེ་ནས་ ཡང་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ དང་ །_ [45a] བརྟན་པ་ ག་ལ་བ་ དེར་ དོང་ ངོ་ །_།
en: With this, they race forth toward the asura rulers Rāhu [45.a] and Firm.

source: དེ་ནས་ ཡང་ སྒྲ་གཅན་ དེ་ བརྟན་པ ས་ ཕྱིར་བཟློག་ སྟེ །_
en: $323 “At this point, Firm will make Rāhu turn around with renewed courage.

source: ཁོང་ བརྟ་ བརྟ་ ནས་ དེ་ནས་ ཡང་ ཕན་ཚུན་ འདུས་ ཏེ །_ ལུས་ ཀྱི་ མཐུ་ དང་ དཔུང་ ཚོལ་ བར་ འདོད་པ་ འདུས་པ་ དག་ ལྷ་ ག་ལ་བ་ དེར་ ཕྱིར་ལོག་པ་ དང་ །_
en: As Rāhu’s physical strength and his wish to pursue the army combine, he once more returns to battle.

source: ལྷ་ ལག་ ན་ཡོལ་ གོ་ ཐོགས་པ་ དང་ །_ ལྷ་མ་ ཡིན་ སྒྲ་གཅན་ གྱི་ ས ར་ གཏོགས་པ་ མགུལ་ ཕྲེང་ དེ་དག་ དང་ ཕན་ཚུན་ དགྲ ར་ གྱུར་པ །_ ཕན་ཚུན་ མི་ བཟོད་པ །_ སོ་སོ འི་ དཔུང་ ཆེན་པོ འི་ གཡུལ་འགྱེད་ དེ །_
en: The vessel-bearer gods and the ‘necklaces’ that belong to the level of the asura Rāhu will thus meet as enemies, and the two great armies will enter a battle that is horrific on both sides.

source: རི འི་ རྩེ་མོ་ རྣམས་ དང་ །_ བྲག་ གི་ རྩེ་མོ་ རྣམས་ དང་ །_ མདའ་ ཆར་ ལྟར་ འབབ་པ་ རྣམས་ དང་ །_ མཚོན་ཆ ར་ ལྟར་ འབབ་པ་ རྣམས་ དང་ །_ ཤིང་ ལྗོན་པ་ ཆར་ ལྟར་ འབབ་པ་ རྣམས་ ཀྱིས་ རྟག་ ཏུ་ ནམ་མཁའ་ ཕན་ཚུན་ མུན་པ་ ཐིབས་པོ་ ལྟར་ གསལ་བ ར་ མི་ མངོན་ ཏེ་ བར་ཆད་ བྱེད་པ་ བྱེ་བ་ འབུམ་ཕྲག་ དུ་མ འི་ གཡུལ་ དཔེ་མེད་པ་ འགྱེད་ དོ །_།
en: As mountaintops, rocky summits, arrows, weapons, and trees shower down like rain, the sky above the two armies becomes thoroughly dark, without a trace of light. In this manner, they will struggle to defeat each other in an unrivaled battle.

source: དེ་ལྟ ར་ ལྷ་ རྣམས་ ཀྱི་ ཡན་ལག་ དང་ ཉིང་ལག་ བཅད་ ཅིང་ གཏུབས་པ་ དག་ ནི་ དེ་ནས་ ཡང་ སྔ་མ་ བཞིན་ སླར་སྐྱེ འོ །_།
en: $324 “When a god’s major or minor body part is severed, the limb in question will grow out again just as before.

source: ལྷ་མ་ ཡིན་ རྣམས་ ཀྱི་ ཡན་ལག་ དང་ ཉིང་ལག་ དུ་མ་ བཅད་པ་ དག་ ནི་ ནད་ དང་ བཅས་པ ར་ འགྱུར་ ལ །_ སྐྱེ་བ ར་ ཡང་ མི་ འགྱུར་ རོ །_།
en: However, when an asura loses a body part, he will be afflicted by the loss and no replacement will grow out.

source: མགོ་ བཅད་པ་ རྣམས་ ཀྱང་ མི་དང་འདྲ་ བར་མི་ སྐྱེ འོ །_།
en: Just as with humans, neither will the head of an asura grow out again once it has been cut off.

source: ལྷ་ རྣམས་ ཀྱང་ མགོ་ བཅད་པ་ དང་ །_ རྐེད་པ་ བཅད་པ་ ཡང་ འཆི་བ ར་ འགྱུར་ རོ །_།
en: As for the gods, they only die once they have been decapitated or cut through at the waist.

source: དེ་ལྟ ར་ ལྷ་མ་ ཡིན་ ཇི་ལྟ་བ་ དེ་ལྟ ར་ ལྷ་ རྣམས་ ཟད་པ ར་ མི་ འགྱུར་ རོ །_།
en: In this way, the gods will not suffer losses as great as those of the asuras.

source: དེ་ནས་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ རྣམ་པར་ ཉམས་པ་ ན་ ལྷ་མ་ ཡིན་ རྣམས་ ཤིན་ཏུ་ ཟད་པ་ དེ་ལྟ ར་ ལྷ་ རྣམས་ ནི་ མ་ ཡིན་ ནོ །_།
en: Consequently, although the gods and asuras both sustain losses, the gods do not face total annihilation in the same way as the asuras.

source: དེ་ནས་ ལྷག་མ་ ཕྱེད་ཙམ་ ལུས་པ་ ལྷ་ རྣམས་ ཀྱིས་ བཅོམ་པ །_ སྐྱབས་ འདོད་པ །_ དཔུང་གཉེན་ འདོད་པ་ དག་ས འི་ འོག་ གི་ སྒོ་ ག་ལ་བ་ དེར་ རྒྱུག་པ ར་ བྱེད་ དེ །_ སྒྲ་ ཧ་ ཧ་ འབྱིན་པ འི་ ལྷ་ རྣམས་ ཀྱིས་ ཉེ་བ ར་ བཅོམ་པ །_ བརྩོན་འགྲུས་ ཆུང་བ །_ སྐྱབས་ ཞན་པ །_ སྲོག་ དམན་པ་ དག་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ དང་ ཡང་ ལྷན་ཅིག་ སྒྲ་གཅན་ དང་ ཡང་ ལྷན་ཅིག་ ཏུ་ བྲོས་ སོ །_།
en: When their numbers have been halved at the hands of the gods, the asuras will flee below the ground, yearning for refuge and protection, while the gods triumphantly laugh, ‘The asura rulers Firm and Rāhu have little vigor, their refuge is weak, and their life force is inferior—now they flee all together!’

source: ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ དེ་ གཉིས་ མཐུ་ ཉམས་ ཤིང་གནས་ ཉམས་པ་ དག་ མེ་ཏོག་ ཕྲེང་ གིས་ མཐོང་ ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ གསུམ་པ་ ལ་ སྨྲས་པ །_ འདི་ལྟར་ བདག་ཅག་ གི་ ལྷ་མ་ ཡིན་ ག་ [45b] ལ་བ་ དེར་ འདོང་ གིས་ རྒྱུགས་ ཤིག _། བརྩོན་འགྲུས་ ཆུང་བ འི་ ལྷ་ རྣམས་ བདག་ཅག་ གི་ དཔུང་ དང་ །_ བརྩོན་འགྲུས་ དང་ འཐུན་ པས་ ཕམ་པ ར་ བྱ འོ །_།
en: $325 “When Puṣpamāla sees that the strength and support of the former two asura rulers have thus been eroded, he will say to the third asura ruler, ‘Let us rush to the side of our asuras! [45.b] The vigor of the gods is weak, and we shall defeat them in accordance with our superior might and potency!’

source: དེས་ དེ་སྐད་ སྨྲས་པ་ དང་ །_ དེ་ནས་ མེ་ཏོག་ ཕྲེང་ ལྷ་ རྣམས་ ག་ལ་བ་ དེར་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: At that point Puṣpamāla begins charging the gods.

source: དེ་ནས་ དེ་དག་ འོང་བ་ མཐོང་ ནས་ དཔུང་ ཆེན་པོ ས་ དེ་ནས་ ཡང་ བཅོམ་པ འི་ ལྷག་མ་ ཕན་ཚུན་ གྱི་ བརྩོན་འགྲུས་ དང་ །_ ཕན་ཚུན་ གྱི་ དཔུང་ གིས་ འདུས་པ་ བདག་ཉིད་ དང་ འཁོར་ མང་པོ་ དང་ བཅས་པ་ ཕྱིར་ལོག་ སྟེ་ ཕན་ཚུན་ འདི་སྐད་ སྨྲ འོ །_།
en: $326 “When they see him coming, the remnants of the asuras who were defeated by the great army will regain their vigor and strength and will tell each other,

source: འདི་ལྟར་ ལྷ་མ་ ཡིན་ ཞེས་ མིང་ དུ་ བཏགས་པ་ འདི་ ཅི་ འབྲོས་པ་ ཁོ་ན ར་ གྱུར་ ཏམ །_ བརྩོན་པ་ ལ་ མི་ གནས་ སམ །_ མཚོན་ཆ་ ལ་ མི་ རྟེན་པ་ ལྟ་ ཞིག་ སྟེ །_
en: ‘Must the so-called “asura” always be merely someone who runs away, someone who lacks ambition, and someone who cannot stick to his weapons?

source: རང་ གི་ གནས་ སུ་ ཡོངས་སུ་ ཉམས་པ ར་ འགྱུར་ ལ །_ ཆུང་མ་ དེ་དག་ གི་ ནང་ དུ་ ཡོངས་སུ་ ཉམས་པ ར་ འགྱུར་ རོ །_།
en: Is he someone who sits defeated at home—someone who sits at home with his wife, overpowered?’

source: དེ་སྐད་ སྨྲས་ ནས །_ དེ་ནས་ ཡང་ དཔུང་ དང་ མཐུ་ རྒྱས་པ་ མཚོན་ཆ་ སྣ་ཚོགས་ ཐོགས་པ་ དག་ ལྷ་ ག་ལ་བ་ དེར་ རྒྱུག་པ ར་ བྱེད་ དེ །_
en: Thus, with great might and strength, they will once again charge toward the gods, brandishing their various weapons.

source: རི འི་ རྩེ་མོ་ འཚེར་བ་ ལྟ་བུ་ དང་ རླུང་ གི་ ཤུགས་ ལྟར་ མངོན་པར་ མགྱོགས་པ་ དེ་དག་ གཡུལ་འགྱེད་པ འི་ ཕྱིར་ཡང་ ལོག་ གོ །_།
en: Like blazing mountain peaks, they shall return to battle with a speed like the wind.

source: དེ་ནས་ ལྷ་ ཀུན་ དུ་ རྒྱུ་བ་ དང་ །_ ལྷ་ ཕྲེང་ཐོགས་ དང་ །_ ལྷ་ རྟག་ ཏུ་ མྱོས་ གནས་ དང་ །_ ལྷ་ ལག་ ན་ཡོལ་ གོ་ ཐོགས་པ་ ཐམས་ཅད་ ཕན་ཚུན་ དུ་ འདི་ལྟར་ ཀྱེ་མ་ ལྷ་མ་ ཡིན་ འདུས་པ་ འདི་དག་ ཐམས་ཅད་ ནི་ བློ་གྲོས་ མི་ བརྟན་པ་ ཡིན་ ཏེ
en: $327 “At this point, the wandering gods, the garland-bearer gods, the ever-infatuated gods, and the vessel-bearer gods will all say to each other, ‘How sad—the whole league of asuras has such a fickle mindset.

source: ཀྱེ་མ་ ལྷ་མ་ ཡིན་ རྣམས་ གང་ གིས་ བདག་ཉིད་ དང་ །_ བདག་ཅག་ གི་ དཔུང་ གི་ ཁྱད་པར་ ཁོང་ དུ་ ཆུད་ ཀྱང་ དེ་དག་ རྒྱུག་པ ར་ བྱེད་ དོ་ ཞེས་ བརྗོད་ དོ །_།
en: Although these asuras have understood that their army is inferior to ours, they nevertheless come against us.’

source: དེ་དག་ གིས་ དེ་སྐད་ སྨྲས་ ནས །_ ལྷ་ རྣམས་ ཀྱང་ ལྷ་མ་ ཡིན་ དག་ ག་ལ་བ་ དེར་ རྒྱུག་པ ར་ བྱེད་ དོ །_། ཕན་ཚུན་ རྒྱལ་བ་ བརྟོད་པ་ ན་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ དེ་དག་ གཞན་ དང་ མི་ འདྲ་བ འི་ གཡུལ་ བཀྱེ་ སྟེ །_
en: At this point, they will run forth to meet the asuras head-on, and, as the two armies clash, the gods and asuras will wage a battle like no other.

source: ཕན་ཚུན་ རི་བོ་ ཆར་ ལྟར་ འབེབས་པ་ དང་ །_ མེ་ཆར་ ལྟར་ འབེབས་པ་ དང་ །_ རྡོ་ཆར་ ལྟར་ འབེབས་པ་ དང་ །_ མཚོན་ཆ་ ཆར་ ལྟར་ འབེབས་པ་ དང་ །_ དཔུང་ གི་ ཚོགས་ རྣམ་པར་ འཇོམས་པ ས་ མངོན་པར་ བཅོམ་ མོ །_།
en: Sending rains of mountains upon each other, as well as rains of fire, stone, and weapons, the two armies will clash and destroy each other.

source: དེ་དག་ མཚོན་ཆ་ དུ་མ་ དང་ །_ རྣམ་པར་ འཇོམས་པ་ དུ་མ་ དང་ །_ ཉམ་ང་བ་ དུ་མ་ དང་ །_ དེ་ལྟ ར་ སྲོག་གཅོད་པ་ དུ་མ་ དག་ གིས་ གཡུལ་ དཔེ་ [46a] མེད་པ་ བཀྱེ་ སྟེ །_ དེ་དག་ རྒྱ་མཚོ་ ཀུན་ ནས་ བར་ མེད་པར་ འཁོད་ ནས་ གཡུལ་ བཀྱེའོ །_།
en: With numerous weapons, kinds of destruction, horrors, and killings, they will fight a battle beyond compare, [46.a] covering the entire surface of the sea.

source: འདི་ལྟར་ དེ་ གཞན་ དང་ མི་ འདྲ་བ འི་ ཕྱིར་ དེ་ ནི་ དཔེ་ བྱ་བ ར་ ཡང་ མི་ ནུས་ ཏེ །_
en: Since this battle is unlike any other, there is no example for it.

source: དེ་དག་ གཡུལ་ རྣམ་པ་ དུ་མ་ བཀྱེའོ །_། ཀླུ་ རྣམས་ ཀྱང་ ཀླུ་ རྣམས་ དང་ ལྷན་ཅིག་ གཡུལ་ དཔེ་མེད་པ་ བཀྱེའོ །_།
en: Thus, the two sides will wage war, and the nāgas will likewise remain engaged in a war that defies example.

source: དེ་ལྟ ར་ གཡུལ་ རྣམ་པ་ དུ་མ་ དེ་དག་ ལྷ འི་ དབང་པོ་ བརྒྱ་བྱིན་ གྱིས་ མཐོང་ ནས་ སུམ་ཅུ་རྩ་གསུམ་པ འི་ ལྷ་ རྣམས་ ལ་ སྨྲས་པ །_
en: $328 “When Śakra, ruler of the gods, witnesses the many battles, he will tell the gods of the Heaven of the Thirty-Three,

source: འདི་ལྟར་ རབ་དགོད་ ནི་ ད་དུང་ འདུག་ སྟེ མ་གཏོགས་ པར་ ལྷ་མ་ ཡིན་ དེ་དག་ ཐམས་ཅད་ རྒྱུག་པ ར་ བྱེད་ ཀྱིས་ ཁྱེད་ ཆོས་ ཤིག་ ཆོས་ ཤིག _།
en: ‘Overjoyed is still holding out, but the rest of the asuras are all on the run now. So, get ready, get ready!

source: དེ་དག་ ཆས་པ འི་ ཕྱིར་ བདག་ ཀྱང་ གླང་པོ་ཆེ་ ས་སྲུང་ གི་ བུ་ ལ་ ཞོན་ ཏེ་ ཆ འོ །_།
en: I shall ride forth on my elephant, Airāvaṇa, to fight whomever remains.’

source: དེ་ནས་ བརྒྱ་བྱིན་ གྱིས་ ལྷ་ རྣམས་ ལ་ དེ་སྐད་ སྨྲས་ ནས་ ཡིད་ རྩེ་གཅིག་ གིས་ གླང་པོ་ཆེ་ ས་སྲུང་ གི་ བུ་ ལ་ འདི་སྐད་ ཅེས་ སྨྲས་ སོ །_།
en: $329 “Having given the gods that message, he shall now, with one-pointed mind, say to his elephant, Airāvaṇa,

source: གླང་པོ་ཆེ འི་ རྒྱབ་ ཏུ་ ཞོན་ ཏེ །_ ངས་ ལྷ་མ་ ཡིན་ གྱི་ ལྷག་མ་ ལུས་པ་ ཐགས་ བཟངས་ རིས་ དང་ །_ རབ་དགོད་ ཁོ་ན་ དང་ །_ ལྷ་མ་ ཡིན་ དེ་དག་ གི་ ལྷག་མ་ ཐམས་ཅད་ ལས་ རྣམ་པར་ རྒྱལ་བ ར་ བྱ འོ །_།
en: ‘Riding on your back, my elephant, I shall defeat Vemacitrin, Overjoyed, and any other remaining asura!’

source: དེ་སྐད་ སྨྲས་ ནས །_ དེ་ རྡོ་རྗེ་ གསོར་ ཏེ་ ལྷ་མ་ ཡིན་ གྱི་ དཔུང་ ལ་ ཀུན་ དུ་ ལྟ་ ཞིང་ འདུག་ གོ །_།
en: He will then hold up his vajra and keep his gaze fixed on the asuras.

source: དེ་ནས་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ གཡུལ་ ཤིན་ཏུ་ མི་བཟད་པ ར་ འཇུག་པ་ ན །_ ལྷ་མ་ ཡིན་ རྣམས་ ནི་ ཡོངས་སུ་ ཉམས །_
en: $330 “In the utterly unbearable battle that ensues, the asuras will suffer a crushing defeat.

source: ལྷ་ རྣམས་ ནི་ རྒྱལ་ ཏེ་ ཤིན་ཏུ་ དགའ་ ནས །_ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱི་ དྲུང་ དུ་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: The victorious gods will be filled with elation and continue pursuing the asuras.

source: ལྷ་ རྣམས་ ཀྱི་ དབང་པོ་ བརྒྱ་བྱིན་ ཡང་ འཛུམ་ རངས་ ཏེ །_ ལྷ་མ་ ཡིན་ ཐམས་ཅད་ ཀྱི་ དཔུང་ འཇོམས་ སུ་ ཆས་པ་ ན་ རབ་དགོད་ འདི་ སྙམ་ དུ་ སེམས་ ཏེ །_
en: Smiling, Śakra, ruler of the gods, will set out to vanquish all the asuras. $331 “When Overjoyed beholds all this, he will think to himself,

source: ཀྱེ་མ་ འདི་ལྟར་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ གསུམ་པོ་ དང་ །_ གནས་ གསུམ་ ན་ འཁོད་པ འི་ ལྷ་མ་ ཡིན་ བྱེ་བ་ ཕྲག་ དུ་མ་ མཐུ་ ཉམས་པ ར་ བྱས་པ་ འདི་དག་ ནི་ ཇི་ལྟ ར་ སྔར་ མཚོ་ ཀུན་མཐོང་ དུ་ མཐོང་བ་ དེ་ལྟ ར་ འདི་དག་ གྱུར་ ཏེ
en: ‘Alas, the three asura rulers and the inhabitants of their realms, numbering many millions, have all been defeated. That which was seen reflected in Mirror Lake has indeed come to pass.

source: ཀྱེ་མ་ མཚོ་ དེར་ མཐོང་བ་ ནི་ མ་ ནོར་བ་ ཡིན་ ནོ །_།
en: Alas, the omen observed upon the lake was not mistaken.

source: འདི་ལྟར་ བརྒྱ་བྱིན་ ཕམ་པ ར་ བྱ་བ་ དང་ །_ ལྷ་ ཐམས་ཅད་ ཀྱང་ གཞོམ་པ ར་ བྱ་བ འི་ ཕྱིར་ བདག་ ཆ་ སྟེ །_
en: I must nonetheless set out to defeat Śakra and crush all the gods!

source: ཀྱེ་མ་ ལྷ་ དེ་དག་ དང་ བདག་ ཁྱད་པར་ ཅང་ མེད་ དོ་ སྙམ་ མོ །_།
en: Ah, these gods are not different from me at all!’

source: བློ་ དེ་ལྟ་ བུ་ བསྐྱེད་ ནས་ གཡུལ་ དུ་ རིངས་པ ར་ འཇུག་པ ར་ བྱ་བ འི་ ཕྱིར་ ས འི་ འོག་ གི་ སྒོ ར་ འཁོད་ དོ །_།
en: $332 “With such thoughts in mind, he will proceed to take a position at the gateways to the subterranean world, seeking to quickly enter into warfare.

source: རབ་དགོད་ [46b] དང་ ཐགས་ བཟངས་ རིས་ ཁྲོས་པ ས་ གཟིར་བ་ དེ་ཉིད་ དུ་ འཁོད་པ་ དང་ རི་ ཀུན་ ནི་ གཡོས །_ རྒྱ་མཚོ་ ཡང་ རླབས་ རྣམས་ ཀྱིས་ ཀུན་ ཏུ་ འཁྲུགས་པ ར་ བྱེད །_ ཉི་མ འི་ འོད་ཟེར་ དམར་པོ་ ཐམས་ཅད་ ཀྱང་ རི་ ལ་ ཤར་ ཏེ །_
en: When Overjoyed[46.b] and Vemacitrin, afflicted by anger, thus take their positions too, all the mountains will shake, waves will swell throughout the ocean, and red sunrays will fall upon the mountains.

source: འཁོར་ དང་ བཅས་པ་ ས འི་ འོག་ གི་ སྒོ་ དེ་ཉིད་ དུ་ འཁོད་པ་ དང་ །_ དེ་ནས་ ལྷ་ རྣམས་ ཀྱིས་ ལྷ་མ་ ཡིན་ སྒྲ་གཅན་ ལ་སོགས་པ་ ཕམ་པ ར་ བྱས་ ཤིང་ ཉམས་པ ར་ བྱས་པ་ རྣམས་ ས འི་ འོག་ གི་ སྒོ་ ག་ལ་བ་ དེར་ རྒྱུག་ ཅིང་ སྤྲོ་བ་ མེད་པ །_ མགོན་མེད་པ །_ ཀུན་ ནས་ གནོད་པ །_ ཧ་ ཧ འི་ སྒྲ་ རྣམས་ ཀྱིས་ སེམས་ དཀྲུགས་པ །_ ཀུན་ ནས་ ཞུམ་པ །_ མགོན་མེད་ པར་ གྱུར་པ་ རྣམས་
en: $333 “Meanwhile, the gods will talk among each other about the way Rāhu and the other asuras have been defeated and beaten, and how they have fled to the gateways of the subterranean world—miserable, without protector, harmed from all sides, distraught, and humiliated by the sounds of laughter. $334

source: དེ་སྐད་ ཕན་ཚུན་ རྗོད་པ་ ན་ ལྷ་མ་ ཡིན་ གཞན་ ཁ་ཅིག་ གིས་ སྨྲས་པ །_
en: “Yet at that point some other asuras will call out,

source: ལྷ་མ་ ཡིན་ དག་མ་ འབྲོས་ མ་ འབྲོས །_ ཅི་སྟེ་ བྱོལ །_ ཅི་སྟེ་ བྲོས །_ སླར་ ལོག་ སླར་ ལོག _།
en: ‘Asuras, do not flee, do not flee! Come back, come back!’

source: དེ་སྐད་ སྨྲ་ ཞིང་ ཕན་ཚུན་ དེ་སྐད་ བརྗོད་པ འི་ ལྷ་མ་ ཡིན་ རྣམས་ རི་རྩེ་ མོ་ ཅན་ ཆར་ ལྟར་ ཕབ་པ ས་ ཀུན་ དུ་ བཏགས་པ་ ན །_
en: As the asuras relay this message to each other, they will once again begin to hurl a torrent of mountaintops at the gods.

source: ལྷ་ ཡིད་ རབ་ཏུ་ དགའ་བ་ རྣམས་ ལྷ་མ་ ཡིན་ ཆོས་ དང་ མི་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ མི་ འཇུག་པ་ དག་ ཟུང་ ཤིག་ གཏོགས་ ཤིག _།
en: $335 “In response the joyous gods will say, ‘The asuras are unrighteous and do not follow the Dharma! Therefore, let’s seize them and take them captive!

source: བདག་ཅག་ ལ་ དུད་འགྲོ་ འདི་དག་ གློ་བུར་ དུ་ ཁྲོ་བ ར་ བྱེད་ ཀྱང་ གཡུལ་ ལ་ འཇིགས་པ་ མེད་ དེ ལྷ་ ངན་པ་ འདི་དག་ གི་ གཡུལ་ ལ་ འཇིགས་པ་ མེད་ དོ །_།
en: Those animals keep getting furious at us for no reason and when they do, they have no fear of combat. Those unholy gods have no fear of war!

source: མཚོན་ཆ་ དང་ །_ ལག་ཆ་ ལ་ མཁས་པ་ ཡང་ མ་ ཡིན་ ཏེ །_ འདི་དག་ ནི་ ཇི་ལྟ ར་ སླར་ ལྡོག་པ ར་ མི་འགྱུར་བ་ དེ་ལྟ ར་ རྒྱལ་བ ར་ བྱ་ སྟེ །_
en: Still, they have no skill with weapons and arms, so we shall defeat them to ensure that they never come back.

source: ཀྱེ་མ་ དུས་ མ་ཡིན་པ འི་ གཡུལ་འགྱེད་ པར་ རྟག་ ཏུ་ འདོད་པ་ འདི་དག་ ནི་ ཇི་ལྟ ར་ ཕྱིར་ མི་ ལྡོག་པ ར་ འགྱུར་བ་ དེ་ལྟ ར་ རྒྱལ་བ ར་ བྱ འོ །_།
en: Ah, since they are so obsessed with fighting untimely wars, let us vanquish them, so they never again return!’

source: དེ་ལྟ ར་ ཕན་ཚུན་ སྤྲོ་བ་ བསྐྱེད་ ནས །_
en: $336 “In this manner, the gods will encourage each other.

source: ལྷ་མ་ ཡིན་ རྣམས་ ཤིན་ཏུ་ གཞོམ་པ ར་ ཡིད་ ཞུགས་པ་ ཁྲོས་པ་ མིག་ ཤིན་ཏུ་ དམར་བ་ དག་ ལྷ་མ་ ཡིན་ ག་ལ་བ་ དེར་ དོང་ ནས་ རལ་གྲི་ དང་ །_ མཚོན་ཆ་ ཀུན་ ནས་ ཆར་ ལྟར་ འབེབས་ ཏེ །_ ཇི་ལྟ ར་ ཆར་ གྱི་ རྒྱུན་འབབ་པ་ ལྟར་ འབེབས་ ཤིང་ །_ དེ་ལྟ ར་ མེ་ ཡང་ཆ ར་ ལྟར་ འབེབས་ སོ །_།
en: With their minds set on crushing the asuras, they will now charge, eyes red with rage, releasing upon them a steady downpour of swords, weapons, and fire.

source: དེ་ནས་ དེ་ལྟ ར་ ལྷ་མ་ ཡིན་ བློང་ བློང་པོ ར་ འཁོད་པ་ ཤིང་རྟ་ འབུམ་ སྙེད་ ལ་ ཞོན་པ །_ ལྷ་མ་ ཡིན་ དུ་མ ས་ ཡོངས་སུ་ བསྐོར་བ་ དག་ས འི་ འོག་ གི་ སྒོ ར་ འཁོད་ དེ །_ ལྷ་ རྣམས་ ག་ལ་བ་ དེར་ མཚོན་ཆ་ སྣ་ཚོགས་ ཆར་ ལྟར་ འབེབས་ ལ །_ རི་ དཔག་ཚད་ གསུམ་ དང་ །_ བཞི་ དང་ །_ ལྔ འི་ ཚད་ ཙམ་ འཕེན་པ ར་ བྱེད་ དོ །_།
en: $337 “Yet the hordes of asuras assembled at the gateways to the subterranean world shall now ride forth upon hundreds of thousands of chariots, each surrounded by numerous other asuras, and they will also bring down a great downpour of different weapons upon the gods and hurl mountains that measure three, four, and even five leagues upon them. [47.a]

source: དེ་ལྟ་ བུ་ ཆར་ [47a] ལྟར་ མངོན་པར་ འབེབས་པ་ དང་ །_ རྣམ་པ་ དེ་ལྟ་ བུར་ ཆས་པ་ དེ་དག་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱིས་ ཀྱང་ མངོན་པར་ མཐོང་ ནས །_ དེ་ནས་ ཡང་ དབུགས་ ཕྱིན་ ཏེ །_ གཡུལ་འགྱེད་ པར་ ཕྱིར་ལོག་ ནས །_ རབ་དགོད་ དང་ ལྷ་མ་ ཡིན་ དེ་དག་ ཉིད་ ལ་ སྤྲོ་བ་ སྐྱེད་པ ར་ བྱེད་ དེ །_
en: When the other asuras witness that display of tremendous force, they will regain their strength and rejoin the battle. $338 “To bolster the asuras, Overjoyed will cry,

source: འདི་ལྟར་ བདག་ ནི་ ལྷ་ ཐམས་ཅད་ གཞོམ་པ འི་ ཕྱིར་ ཆས་པ་ ཡིན་ གྱིས་ ལྷ་མ་ ཡིན་ དག་ སླར་ ལོག་ སླར་ ལོག _།
en: ‘I have set out to vanquish all the gods. Asuras, return, return!

source: ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ དག་ཅི་ སྟེ་ འབྲོས་ ཅི་སྟེ་ འབྲོས །_
en: Rulers of asuras, don’t run, don’t run!

source: མ་ལ་ ཁྱིམ་ དུ་ བུད་མེད་ དག་ གི་ ངོར་ ཡང་ ཇི་སྐད་ སྨྲ །_
en: Ah, what would you say to your women back home?

source: འདི་ལྟར་ སྐྱེས་པ་ ནི་ བདག་ཅག་ ཡིན་ ན་ སྐྱེས་པ འི་ མིང་ ཡང་ མེད་ དེ །_
en: We are men, but if we flee, would we be worthy of that name?

source: སྐྱེས་པ་ ཞེས་ བྱ་བ་ དོན་མེད་ པར་ འགྱུར་ རོ །_།
en: Calling us men would be meaningless.’

source: དེ་སྐད་ སྨྲས་པ་ དང་ །_ རབ་དགོད་ ལྷ་ རྣམས་ ག་ལ་བ་ དེར་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: $339 “Having said that, Overjoyed will proceed to storm the gods.

source: དེ་ རྒྱུག་པ་ མངོན་པར་ མཐོང་ ནས་ ལྷ་ རྣམས་ ཀྱང་ དེ་ དང་ གཡུལ་འགྱེད་ པར་ རབ་དགོད་ ག་ལ་བ་ དེར་ བརྒྱུགས་ སོ །_།
en: When the gods see him coming, they will exuberantly rush forward to meet him in battle.

source: ལྷ་ དང་ ལྷ་མ་ ཡིན་ དེ་དག་ ཕན་ཚུན་ གཡུལ་ འདྲེས་པ ར་ བཀྱེ་ སྟེ །_ སྒྲ་ བྱུང་བ་ གང་ཡིན་པ་ དེས་ རི འི་ ལྕོང་ དང་ རི་རབ་ ཐམས་ཅད་ ཀྱང་ ཀུན་ དུ་ གང་ ངོ་ །_།
en: As the gods and asuras clash, the noise will resound everywhere, from the lowest of the mountains to Mount Sumeru itself.

source: སྒྲ་གཅན་ འབའ་ཞིག་ ལམ་ དུ་ ཞུགས་ ནས་ ལྷ་ ལག་ ན་ཡོལ་ གོ་ ཐོགས་པ་ དག་ ག་ལ་བ་ དེར་ བརྒྱུགས་ སོ །_། ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ ལག་ ན་ དབྱུག་ ཏོ་ ཐོགས་པ་ ཡང་ ལྷ་ ཕྲེང་ཐོགས་ དག་ ག་ལ་བ་ དེར་ བརྒྱུགས་ སོ །_།
en: $340 “Rāhu will for his part set out against the vessel-bearer gods, and the asura ruler Firm will charge the garland-bearer gods, brandishing his staff.
